In [1]:
#Importing the library
from cassandra.cluster import Cluster 
cluster = Cluster()
conn = cluster.connect('myspace') #Creating connection with Cassandra
conn

:0: UserWarning: You do not have a working installation of the service_identity module: 'cannot import name opentype'.  Please install it from <https://pypi.python.org/pypi/service_identity> and make sure all of its dependencies are satisfied.  Without the service_identity module, Twisted can perform only rudimentary TLS client hostname verification.  Many valid certificate/hostname mappings may be rejected.

In [2]:
#Creating employees table
conn.execute("""CREATE TABLE employees ( emp_id int PRIMARY KEY, 
              emp_name text, 
              emp_city text, 
              emp_sal varint, 
              emp_phone varint )"""
)

In [3]:
#Inserting the values inside the table
conn.execute(
    """BEGIN BATCH 
    INSERT INTO employees (emp_id, emp_city, emp_name, emp_phone, emp_sal) 
    VALUES (1, 'Bangalore', 'Ajay', 123890, 45000); 
    INSERT INTO employees (emp_id, emp_city, emp_name, emp_phone, emp_sal) 
    VALUES (2, 'Chennai', 'Robin', 324878, 50000); 
    INSERT INTO employees (emp_id, emp_city, emp_name, emp_phone, emp_sal) 
    VALUES (3, 'Hyderabad', 'Raj', 453465, 60000); APPLY BATCH """)

In [4]:
result = conn.execute("SELECT * FROM employees")
result = list(result)
result

[Row(emp_id=1, emp_city=u'Bangalore', emp_name=u'Ajay', emp_phone=123890, emp_sal=45000),
 Row(emp_id=2, emp_city=u'Chennai', emp_name=u'Robin', emp_phone=324878, emp_sal=50000),
 Row(emp_id=3, emp_city=u'Hyderabad', emp_name=u'Raj', emp_phone=453465, emp_sal=60000)]

In [5]:
for row in result:
    print(row.emp_id, row.emp_city, row.emp_name, row.emp_phone, row.emp_sal)

(1, u'Bangalore', u'Ajay', 123890, 45000)
(2, u'Chennai', u'Robin', 324878, 50000)
(3, u'Hyderabad', u'Raj', 453465, 60000)

In [6]:
import pandas
df = pandas.DataFrame(list(result))
df

   emp_id   emp_city emp_name  emp_phone  emp_sal
0       1  Bangalore     Ajay     123890    45000
1       2    Chennai    Robin     324878    50000
2       3  Hyderabad      Raj     453465    60000

In [7]:
conn.execute("DROP TABLE EMPLOYEES")